Repository: helwan-linux/helwan-insight
Catalog: helwan-insight/locales/*/LC_MESSAGES/helwan_insight.po
Languages: ar

source: Helwan-Insight - Data Analysis Tool
ar: حلوان-إنسايت - أداة تحليل البيانات

source: &File
ar: ملف

source: &Load Data
ar: تحميل البيانات

source: Load data from a file
ar: تحميل البيانات من ملف

source: E&xit
ar: خروج

source: Exit the application
ar: الخروج من التطبيق

source: &Help
ar: مساعدة

source: &About
ar: عن البرنامج

source: Show information about Helwan-Insight
ar: عرض معلومات عن Helwan-Insight

source: Welcome to Helwan-Insight! Load your data to get started.
ar: مرحباً بك في حلوان-إنسايت! قم بتحميل بياناتك للبدء.

source: Ready
ar: جاهز

source: Language Change
ar: تغيير اللغة

source: The language will be applied. Some elements might require a restart to fully update.
ar: سيتم تطبيق اللغة. قد تتطلب بعض العناصر إعادة تشغيل للتحديث الكامل.

source: Load Data File
ar: تحميل ملف البيانات

source: Data Files (*.csv *.xlsx *.xls);;All Files (*)
ar: ملفات البيانات (*.csv *.xlsx *.xls);;جميع الملفات (*)

source: Loading data... Please wait.
ar: جارٍ تحميل البيانات... يرجى الانتظار.

source: Unsupported File Type
ar: نوع ملف غير مدعوم

source: Please select a CSV or Excel file.
ar: الرجاء تحديد ملف CSV أو Excel.

source: Success
ar: نجاح

source: Data loaded successfully from {file_path}. Rows: {rows}, Columns: {cols}
ar: تم تحميل البيانات بنجاح من {file_path}. الصفوف: {rows}، الأعمدة: {cols}

source: Data loaded successfully! Rows: {rows}, Columns: {cols}
ar: تم تحميل البيانات بنجاح! الصفوف: {rows}، الأعمدة: {cols}

source: Error
ar: خطأ

source: Failed to load data: {e}
ar: فشل تحميل البيانات: {e}

source: Error loading data.
ar: خطأ في تحميل البيانات.

source: Plot Info
ar: معلومات الرسم البياني

source: Plotting for Text columns will be implemented soon!
ar: سيتم تنفيذ الرسم البياني للأعمدة النصية قريباً!

source: Time Series plotting will be implemented soon!
ar: سيتم تنفيذ الرسم البياني للسلاسل الزمنية قريباً!

source: Plot Error
ar: خطأ في الرسم البياني

source: Unsupported plot type requested.
ar: نوع الرسم البياني المطلوب غير مدعوم.

source: Plotting area not available.
ar: منطقة الرسم البياني غير متاحة.

source: Histogram of
ar: مخطط التوزيع التكراري لـ

source: Bar Chart of
ar: مخطط الأعمدة لـ

source: Dashboard
ar: لوحة التحكم

source: Data Summary
ar: ملخص البيانات

source: Visualizations
ar: الرسوم البيانية

source: Column:
ar: العمود:

source: Select Column
ar: اختر عمود

source: Data Type:
ar: نوع البيانات:

source: Unique Values:
ar: القيم الفريدة:

source: Missing Values:
ar: القيم المفقودة:

source: Mean:
ar: المتوسط:

source: Median:
ar: الوسيط:

source: Mode:
ar: المنوال:

source: Std Dev:
ar: الانحراف المعياري:

source: Min:
ar: الحد الأدنى:

source: Max:
ar: الحد الأقصى:

source: Count:
ar: العدد:

source: Top 5 values:
ar: أعلى 5 قيم:

source: Value
ar: القيمة

source: Frequency
ar: التكرار

source: Summary Statistics for
ar: إحصائيات ملخصة لـ
